[
  {
    "bookId": 1,
    "bookName": "The Journey of Prophet Muhammad",
    "author": "Hamza Al Siddiq",
    "image": "https://i.ibb.co/7tbZzc1/Journey-of-Prophet-Muhammad.jpg",
    "review": "Hamza Al Siddiq's 'The Journey of Prophet Muhammad' offers a profound exploration of the life and teachings of the Prophet. It delves into the historical context, the challenges faced, and the wisdom imparted, presenting a comprehensive biography. This book serves as an enlightening guide, shedding light on the Prophet's remarkable journey and his enduring legacy.",
    "totalPages": 400,
    "rating": 4.8,
    "category": "Biography",
    "tags": ["Religion","Biography"],
    "publisher": "Islamic Foundation",
    "yearOfPublishing": 2001
  },
  {
    "bookId": 2,
    "bookName": "Secret of Divine Love",
    "author": "A. Helwa",
    "image": "https://i.ibb.co/MDvVngn/Secret-of-Divine-Love.jpg",
    "review": "Evie Woods' 'Secret of Divine Love' takes readers on a spiritual journey, exploring the depths of divine love and spirituality. With profound insights and inspiring narratives, this book offers guidance for those seeking a deeper connection with the divine. It's a transformative read that touches the heart and soul, reminding us of the power of love and faith.",
    "totalPages": 250,
    "rating": 4.5,
    "category": "Spirituality",
    "tags": ["Spirituality", "Inspirational"],
    "publisher": "Threshold Books",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 3,
    "bookName": "The Forgotten 500",
    "author": "Gregory A. Freeman",
    "image": "https://i.ibb.co/jVrJk78/The-Forgotten-500.jpg",
    "review": "An untold World War II story of heroism and survival, 'The Forgotten 500' by Gregory A. Freeman captivates readers with its gripping narrative. It sheds light on a lesser-known chapter of history, highlighting the bravery and sacrifices of individuals in the face of adversity. Freeman's meticulous research and engaging storytelling make this book a compelling read for history enthusiasts.",
    "totalPages": 320,
    "rating": 4.7,
    "category": "History",
    "tags": ["History", "Military"],
    "publisher": "NAL Caliber",
    "yearOfPublishing": 2008
  },
  {
    "bookId": 4,
    "bookName": "The Lost Bookshop",
    "author": "Evie Woods",
    "image": "https://i.ibb.co/8dFYxwz/The-Lost-Bookshop.jpg",
    "review": "Evie Woods' 'The Lost Bookshop' is a captivating tale that intertwines adventure, mystery, and the power of books. Through vivid characters and enchanting prose, Woods transports readers to a world where lost stories come to life. This book celebrates the magic of literature and the joy of discovery, making it a delightful read for book lovers of all ages.",
    "totalPages": 280,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Fiction", "Adventure", "Mystery"],
    "publisher": "Penguin Random House",
    "yearOfPublishing": 2020
  },
  {
    "bookId": 5,
    "bookName": "The Muslim Woman's Manifesto",
    "author": "Kashmir Maryam",
    "image": "https://i.ibb.co/26CT9fv/The-Muslim-Woman-s-Manisfesto.jpg",
    "review": "Kashmir Maryam's 'The Muslim Woman's Manifesto' offers a thought-provoking exploration of key issues facing Muslim women today. With insightful analysis and personal anecdotes, Maryam challenges stereotypes and advocates for gender equality within Islamic contexts. This book is a must-read for anyone interested in understanding the diverse experiences and voices of Muslim women worldwide.",
    "totalPages": 180,
    "rating": 4.6,
    "category": "Social Sciences",
    "tags": ["Women", "Islam"],
    "publisher": "Oxford University Press",
    "yearOfPublishing": 2015
  },
  {
    "bookId": 6,
    "bookName": "Trust",
    "author": "Hernan Diaz",
    "image": "https://i.ibb.co/NZcfGjV/Trust.jpg",
    "review": "Hernan Diaz's 'Trust' is a gripping thriller that keeps readers on the edge of their seats from start to finish. With twists and turns aplenty, Diaz masterfully crafts a narrative that explores the complexities of trust, betrayal, and redemption. This book is a rollercoaster ride of suspense and intrigue, guaranteed to leave readers guessing until the very end.",
    "totalPages": 350,
    "rating": 4.9,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 2023
  }
]
